
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.appInsightsInstrumentationKey
  * azurerm_key_vault_secret.app_insights_connection_string
* Replace
  * module.application_insights.azurerm_application_insights.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.appInsightsInstrumentationKey will be updated in-place
  ~ resource "azurerm_key_vault_secret" "appInsightsInstrumentationKey" {
        id                      = "https://am-aat.vault.azure.net/secrets/AppInsightsInstrumentationKey/9c3247a2d96649ceb6e11646f18ac7a5"
        name                    = "AppInsightsInstrumentationKey"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.app_insights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_connection_string" {
        id                      = "https://am-aat.vault.azure.net/secrets/app-insights-connection-string/3ececb7c0da7469795d2264a1d3f34c1"
        name                    = "app-insights-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_application_insights.this must be replaced
  # (moved from azurerm_application_insights.appinsights)
-/+ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "5e312829-7e25-4445-9c66-ee63bee6bb04" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> 50
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/am-shared-infrastructure-aat/providers/Microsoft.Insights/components/am-aat" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
        name                                  = "am-aat"
        tags                                  = {
            "application"         = "access-management"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/am-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#am-master-builds"
            "environment"         = "staging"
            "managedBy"           = "AM"
            "team_contact"        = "#am-team"
        }
      + workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod" # forces replacement
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":61,"Program":"tfcmt","SHA1":"","Vars":{}} -->